

// all emojis


// people and faces emoji = 78
// animals emoji = 74
// plants and flowers emoji = 38
// fashion and accessories emoji = 24
// heart and love emoji = 29
// weather and time emoji = 57
// food and drinks emoji = 42
// sports, games and hobbies emoji = 38
// buildings, locations and landmarks emoji = 32
// transport emoji = 59
// books, envelopes and stationery emoji = 55
// technology emoji = 48
// numbers and letters emoji = 30
// hand signs and arrows emoji = 53
// zodaic signs emoji = 13
// symbols emoji = 25
// other emoji = 124




var allemojis = "😄😃😀😊☺😉😍😘😚😗😙😜😝😛😳😁😔😌😒😞😣😢😂😭😪😥😰😅😓😩😫😨😱😠😡😤😖😆😋😷😎😴😵😲😟😦😧😈👿😮😬😐😕😯😶😇😏😑👲👳👮👷💂👶👦👧👨👩👴👵👱👼👸👹👺💀👽💩😺😸😻😽😼🙀😿😹😾🐵🙈🙉🙊🐶🐺🐱🐭🐹🐸🐯🐨🐻🐷🐽🐮🐗🐒🐴🐑🐘🐼🐧🐦🐤🐥🐣🐔🐍🐢🐛🐝🐜🐞🐌🐙🐚🐠🐟🐬🐳🐋🐄🐏🐀🐃🐅🐇🐉🐎🐐🐓🐕🐖🐁🐂🐲🐡🐊🐫🐪🐆🐈🐩🐾💐🌸🌷🍀🌹🌻🌺🍁🍃🍂🌿🌾🍄🌵🌴🌲🌳🌰🌱🌼🍎🍏🍊🍋🍒🍇🍉🍓🍑🍈🍌🍐🍍🍠🍆🍅🌽💮🎩👑👒👟👞👡👠👢👕👔👚👗🎽👖👘👙💼👜👝👛👓🎀🌂💄💛💙💜💚❤💔💗💓💕💖💞💘💌💋💍💎👤👥💬👣💭💝👫👪👬👭💏💑💟🌐🌞🌝🌚🌑🌒🌓🌔🌕🌖🌗🌘🌜🌛🌙🌍🌎🌏🌋🌌🌠⭐☀⛅☁⚡☔❄⛄🌀🌁🌈🌊🕛🕧🕐🕜🕑🕝🕒🕞🕓🕟🕔🕠🕕🕖🕗🕘🕙🕚🕡🕢🕣🕤🕥🕦☕🍵🍶🍼🍺🍻🍸🍹🍷🍴🍕🍔🍟🍗🍖🍝🍛🍤🍱🍣🍥🍙🍘🍚🍜🍲🍢🍡🍳🍞🍩🍮🍦🍨🍧🎂🍰🍪🍫🍬🍭🍯🎨🎬🎤🎧🎼🎵🎶🎹🎻🎺🎷🎸👾🎮🃏🎴🀄🎲🎯🏈🏀⚽⚾🎾🎱🏉🎳⛳🚵🚴🏁🏇🏆🎿🏂🏊🏄🎣🏠🏡🏫🏢🏣🏥🏦🏪🏩🏨💒⛪🏬🏤🌇🌆🏯🏰⛺🏭🗼🗾🗻🌄🌅🌃🗽🌉🎠🎡⛲🎢🚢⛵🚤🚣⚓🚀✈💺🚁🚂🚊🚉🚞🚆🚄🚅🚈🚇🚝🚋🚃🚎🚌🚍🚙🚘🚗🚕🚖🚛🚚🚨🚓🚔🚒🚑🚐🚲🚡🚟🚠🚜💈🚏🎫🚦🚥⚠🚧🔰⛽🏮🎰♨🗿🎪🎭📍🚩📧📥📤✉📩📨📯📫📪📬📭📮📦📝📄📃📑📊📈📉📜📋📅📆📇📁📂✂📌📎✒✏📏📐📕📗📘📙📓📔📒📚📖🔖📛📛🔭📰💰💴💵💷💶💳💸🎥📷📹📼💿📀💽💾💻📱☎📞📟📠📡📺📻🔊🔉🔈🔇🔔🔕📢📣⏳⌛⏰⌚🔓🔒🔏🔐🔑🔎💡🔦🔌🔋🔍🔧🔩🔨📲📶🎦📳📴🔤ℹ🆗🆕🆙🆒🆓🆖🅿Ⓜ🆑🆘🆔🆚🅰🅱🆎🅾©®💯™🔠🏧‼⁉❗❓❕❔👍👎👌👊✊✌👋✋👐👆👇👉👈🙌🙏☝👏💪💅⬇⬅➡↗↖↘↙↔↕🔄◀▶🔼🔽↩↪⏪⏩⏫⏬⤵⤴🔀🔁🔂🔝🔚🔙🔛🔜🔃🔺🔻⬆♈♉♊♋♌♍♎♏♐♑♒♓⛎🚻🚹🚺🚼🚾🚰🚮♿🚭🛂🛄🛅🛃🚫🔞📵🚯🚱🚳🚷🚸⛔♻💠➿🎍🎎🎒🎓🎏🎆🎇🎐🎑🎃👻🎅🎄🎁🎋🎉🎊🎈🎌🔮🔆🔅🛁🛀🚿🚽🚪🚬💣🔫🔪💊💉🔥✨🌟💫💥💢💦💧💤💨👂👀👃👅👄🚶🏃💃👯🙆🙅💁🙋💆💇👰🙎🙍🙇🔯💹💲💱❌⭕✖➕➕➗♠♥♣♦✔☑🔘🔗➰〰〽🔱◼◻◾◽▪▫🔲🔳⚫⚪🔴🔵⬜⬛🔶🔷🔸🔹🈁🈯🈳🈵🈴🈲🉐🈹🈺🈶🈚🈷🈸🈂🉑㊙㊗✳❇✴❎✅";

allemojis = [...allemojis];

console.log(allemojis.length);
console.log(allemojis);




// generating random number

function randomNumber(min, max) {  
    return Math.random() * (max - min) + min; 
}  

console.log(Math.floor(randomNumber(0, allemojis.length)));







// encryption process

function myFunction() {
	
	
	
	
	
	
	// converting text to emoji
	
	
	
	
	
	
	
	
	
	
	


	var letterMap = {
		"A": "🙂",
		"B": "🤓",
		"C": "🐒",
		"D": "⛵",
		"E": "🐦",
		"F": "😎",
		"G": "🌲",
		"H": "🐢",
		"I": "🐎",
		"J": "⚽",
		"K": "👑",
		"L": "🐕",
		"M": "🙃",
		"N": "🍓",
		"O": "😍",
		"P": "🎂",
		"Q": "🏵",
		"R": "🐇",
		"S": "🍬",
		"T": "⭐",
		"U": "🏈",
		"V": "😵",
		"W": "🐩",
		"X": "🌻",
		"Y": "🍇",
		"Z": "🚀",
		"0": "🎃",
		" ": "🩱",
	};





	var inputText = document.getElementById("t-input").value;
	var word = inputText.toUpperCase();
	var encrypted = "";
	for (var i = 0; i < word.length; i++) {
		encrypted += letterMap[word[i]] || word[i];
	}

	//	function clearInput(element) {
	//		element.value = "";
	//	}

	console.log(encrypted);

	document.getElementById("e-output").innerHTML = encrypted;
}









//decryption process

function myFunction1() {


	var letterMap1 = {
		"🙂": "A",
		"🤓": "B",
		"🐒": "C",
		"⛵": "D",
		"🐦": "E",
		"😎": "F",
		"🌲": "G",
		"🐢": "H",
		"🐎": "I",
		"⚽": "J",
		"👑": "K",
		"🐕": "L",
		"🙃": "M",
		"🍓": "N",
		"😍": "O",
		"🎂": "P",
		"🏵": "Q",
		"🐇": "R",
		"🍬": "S",
		"⭐": "T",
		"🏈": "U",
		"😵": "V",
		"🐩": "W",
		"🌻": "X",
		"🍇": "Y",
		"🚀": "Z",
		"🎃": "0",
		"🩱": " ",
	};



	var inputText = document.getElementById("e-input").innerHTML;
	inputText = [...inputText];
	var decrypted = "";
	for (var i = 0; i < inputText.length; i++) {
		decrypted += letterMap1[inputText[i]] || inputText[i];
	}
	//        function clearInput(element) {
	//            element.value = "";
	//        }
	document.getElementById("t-output").innerHTML = decrypted;
}